# ResList_DlgInit

## Description
Use this call during dialog initialization to associate a popup control or resource popup and initialized by the ResList_* calls of the uniqueID identifying the resource list data.

```pascal
PROCEDURE ResList_DlgInit(
				uniqueID : STRING;
				dlgID    : INTEGER;
				ctrlID   : INTEGER);
```

```python

def vs.ResList_DlgInit(uniqueID, dlgID, ctrlID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|uniqueID|STRING||
|dlgID|INTEGER||
|ctrlID|INTEGER||

## Version
Availability: from Vectorworks 2017
## Category
* Tool Events